tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "mongodb/brew"
brew "mas"
######################################################################
# Generalist                                                         #
######################################################################
cask "spotify"
cask "appcleaner"
cask "slack"
######################################################################
# The development, console, server stuff, (Text-)Editors             #
######################################################################
cask "visual-studio-code"
cask "postman"
cask "sourcetree"
cask "burp-suite"
cask "docker"
cask "runjs"
# cask "vagrant"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
######################################################################
# DB                                                                 #
######################################################################
brew "mongodb-community"
######################################################################
# Browser                                                            #
######################################################################
cask "google-chrome"
cask "firefox"
######################################################################
# Node and virtual enviroment                                        #
######################################################################
brew "nvm"
######################################################################
# Git                                                                #
######################################################################
brew "git"
######################################################################
# Fonts                                                              #
######################################################################
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################
cask "iterm2"
# brew "zsh"
brew "zsh-completions"
# brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
tap "homebrew/cask-fonts"
cask "font-meslo-for-powerline"
brew "gcc"
brew "z"
brew "tree"
brew "fzf"
brew "tldr"
######################################################################
# Reconnaissance                                                     #
######################################################################
brew "nmap"
######################################################################
# App store apps                                                     #
######################################################################
mas 'The Unarchiver', id: 425424353
