tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"
cask "google-chrome"
cask "spotify"
cask "appcleaner"
cask "iterm2"
cask "docker"
cask "slack"
cask "visual-studio-code"
cask "postman"
cask "sourcetree"
cask "burp-suite"
cask "firefox"
cask "font-meslo-for-powerline"
cask "google-drive-file-stream"
brew "git"
brew "zsh"
brew "zsh-completions"
brew "gcc"
brew "z"
brew "tree"
brew "fzf"
brew "tldr"
brew "zsh-syntax-highlighting"
brew "nvm"