cask "google-chrome"
cask "spotify"
cask "appcleaner"
cask "iterm2"
cask "docker"
cask "slack"
tap "homebrew/cask-fonts"
cask "font-meslo-for-powerline"
cask "google-drive-file-stream"
cask "scroll-reverser"
brew "git"
brew "zsh"
brew "zsh-completions"
brew "gcc"
brew "z"
brew "tree"
brew "fzf"
brew "tldr"
brew "zsh-syntax-highlighting"
brew "nvm"